//宏定义
#ifndef _CRT_SECURE_NO_WARNINGS
#define _CRT_SECURE_NO_WARNINGS //在VS中使用scanf()、strcmp等函数
#endif // !_CRT_SECURE_NO_WARNINGS

//库函数引用
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//其他功能函数相关代码

//主菜单UI展示
void showMenu() {
    system("cls");  // Windows系统清屏命令  
    printf("                             *******************************************\n");
    printf("                             ********                           ********\n");
    printf("                             ********    学生综合测评系统       ********\n");
    printf("                             ********                           ********\n");
    printf("                             ********    1. 添加学生信息        ********\n");
    printf("                             ********    2. 删除学生信息        ********\n");
    printf("                             ********    3. 修改学生信息        ********\n");
    printf("                             ********    4. 查询学生信息        ********\n");
    printf("                             ********    5. 浏览学生信息        ********\n");
    printf("                             ********    6. 添加学生数据        ********\n");
    printf("                             ********    7. 删除学生数据        ********\n");
    printf("                             ********    8. 修改学生数据        ********\n");
    printf("                             ********    9. 查询学生数据        ********\n");
    printf("                             ********    10.浏览学生数据        ********\n");
    printf("                             ********    0. 退出系统            ********\n");
    printf("                             ********                           ********\n");
    printf("                             *******************************************\n");
    printf("                             请输入0-10来实现对应的功能:");
}

//退出系统
void exitSystem() {
    system("cls");  // Windows系统清屏命令  
    printf("确认退出系统？Y/N\n");
    if (FunAskConfirm()) {
        exit(0);
    }
    printf("本系统继续运行中...\n");
}

//请求用户确认,输入Y和y确认
int FunAskConfirm() {
    char confirm = ' ';
    while (1) {
        confirm = getchar();
        rewind(stdin);//清空标准输入缓存区
        if (confirm == 'Y' || confirm == 'y') {
            return 1;
        }
        else if (confirm == 'N' || confirm == 'n') {
            return 0;
        }
        else {
            printf("输入Y或y确认，输入N或n取消\n");
        }
    }
}

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++